; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v1)
		(pred_3 ?v3)
		(pred_2 ?v8)
		(pred_1 ?v8)
		(pred_5 ?v3 ?v8)
		(pred_4)
		(pred_6 ?v3))

   (:action op_3
       :parameters  (?v5 ?v2)
       :precondition (and (not-eq ?v5 ?v2) 
                          (pred_2 ?v5) (pred_2 ?v2) (pred_1 ?v5))
       :effect (and  (pred_1 ?v2)
		     (not (pred_1 ?v5))))


   (:action op_1
       :parameters (?v4 ?v7)
       :precondition  (and  (pred_3 ?v4) (pred_2 ?v7)
			    (pred_5 ?v4 ?v7) (pred_1 ?v7) (pred_4))
       :effect (and (pred_6 ?v4)
		    (not (pred_5 ?v4 ?v7)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v4  ?v7)
       :precondition  (and  (pred_3 ?v4) (pred_2 ?v7)
			    (pred_6 ?v4) (pred_1 ?v7))
       :effect (and (pred_5 ?v4 ?v7)
		    (pred_4)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_07 obj_01 obj_08 obj_05 obj_04 obj_09 
          obj_02 obj_03 obj_06 
)
(:init
(pred_2 obj_07)
(pred_2 obj_01)
(pred_2 obj_08)
(pred_2 obj_05)
(pred_2 obj_04)
(pred_2 obj_09)
(pred_3 obj_02)
(pred_3 obj_03)
(pred_3 obj_06)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(pred_4)
(pred_5 obj_02 obj_08)
(pred_5 obj_03 obj_04)
(pred_5 obj_06 obj_01)
(pred_1 obj_09)
)
(:goal
(and
(pred_5 obj_02 obj_07)
(pred_5 obj_03 obj_04)
(pred_5 obj_06 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_02 obj_07) (pred_1 obj_01))
    (sometime-before  (pred_5 obj_06 obj_04) (pred_1 obj_07))
  )
)
)

; plan
1. (op_3 obj_09 obj_01)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_01)
   goals met: 1 of 3
2. (op_1 obj_06 obj_01)
   deleted: (pred_5 obj_06 obj_01) (pred_4)
   added: (pred_6 obj_06)
   goals met: 1 of 3
3. (op_3 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_08)
   goals met: 1 of 3
4. (op_2 obj_06 obj_08)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_08) (pred_4)
   goals met: 1 of 3
5. (op_1 obj_02 obj_08)
   deleted: (pred_5 obj_02 obj_08) (pred_4)
   added: (pred_6 obj_02)
   goals met: 1 of 3
6. (op_3 obj_08 obj_07)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_07)
   goals met: 1 of 3
7. (op_2 obj_02 obj_07)
   deleted: (pred_6 obj_02)
   added: (pred_5 obj_02 obj_07) (pred_4)
   goals met: 2 of 3
8. (op_3 obj_07 obj_08)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_08)
   goals met: 2 of 3
9. (op_1 obj_06 obj_08)
   deleted: (pred_5 obj_06 obj_08) (pred_4)
   added: (pred_6 obj_06)
   goals met: 2 of 3
10. (op_3 obj_08 obj_04)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_04)
   goals met: 2 of 3
11. (op_2 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_5 obj_06 obj_04) (pred_4)
   goals met: 3 of 3
